<h1>Mis notas: Pandas<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Intro" data-toc-modified-id="Intro-0"><span class="toc-item-num">0&nbsp;&nbsp;</span>Intro</a></span></li><li><span><a href="#Objetos-de-Pandas" data-toc-modified-id="Objetos-de-Pandas-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Objetos de Pandas</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span><code>Series</code></a></span></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span><code>DataFrame</code></a></span></li><li><span><a href="#Index" data-toc-modified-id="Index-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span><code>Index</code></a></span></li><li><span><a href="#Panel-y-Panel4D" data-toc-modified-id="Panel-y-Panel4D-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span><code>Panel</code> y <code>Panel4D</code></a></span></li></ul></li><li><span><a href="#Indexado-y-selección-de-datos" data-toc-modified-id="Indexado-y-selección-de-datos-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Indexado y selección de datos</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>DataFrame</a></span></li><li><span><a href="#Multi-indexado" data-toc-modified-id="Multi-indexado-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Multi-indexado</a></span></li></ul></li><li><span><a href="#Operaciones-con-datos" data-toc-modified-id="Operaciones-con-datos-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Operaciones con datos</a></span><ul class="toc-item"><li><span><a href="#Operaciones-con-valores-no-disponibles" data-toc-modified-id="Operaciones-con-valores-no-disponibles-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Operaciones con valores no disponibles</a></span></li></ul></li><li><span><a href="#Combinaciones-de-datasets" data-toc-modified-id="Combinaciones-de-datasets-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Combinaciones de datasets</a></span><ul class="toc-item"><li><span><a href="#Concatenación" data-toc-modified-id="Concatenación-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Concatenación</a></span><ul class="toc-item"><li><span><a href="#Concatenación-simple" data-toc-modified-id="Concatenación-simple-4.1.1"><span class="toc-item-num">4.1.1&nbsp;&nbsp;</span>Concatenación simple</a></span></li><li><span><a href="#Concatenación-mediante-joins" data-toc-modified-id="Concatenación-mediante-joins-4.1.2"><span class="toc-item-num">4.1.2&nbsp;&nbsp;</span>Concatenación mediante joins</a></span></li></ul></li><li><span><a href="#Merge-y-Join" data-toc-modified-id="Merge-y-Join-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Merge y Join</a></span><ul class="toc-item"><li><span><a href="#1-1-join" data-toc-modified-id="1-1-join-4.2.1"><span class="toc-item-num">4.2.1&nbsp;&nbsp;</span>1-1 join</a></span></li><li><span><a href="#N-1-join" data-toc-modified-id="N-1-join-4.2.2"><span class="toc-item-num">4.2.2&nbsp;&nbsp;</span>N-1 join</a></span></li><li><span><a href="#N-M-join" data-toc-modified-id="N-M-join-4.2.3"><span class="toc-item-num">4.2.3&nbsp;&nbsp;</span>N-M join</a></span></li></ul></li></ul></li><li><span><a href="#Agregación-y-agrupamiento" data-toc-modified-id="Agregación-y-agrupamiento-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Agregación y agrupamiento</a></span><ul class="toc-item"><li><span><a href="#Agregación-simple" data-toc-modified-id="Agregación-simple-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Agregación simple</a></span></li><li><span><a href="#Agregación-sobre-subconjuntos:-GroupBy." data-toc-modified-id="Agregación-sobre-subconjuntos:-GroupBy.-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Agregación sobre subconjuntos: GroupBy.</a></span></li></ul></li><li><span><a href="#Tablas-dinámicas" data-toc-modified-id="Tablas-dinámicas-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Tablas dinámicas</a></span></li><li><span><a href="#Operaciones-vectorizadas-sobre-cadenas-de-texto" data-toc-modified-id="Operaciones-vectorizadas-sobre-cadenas-de-texto-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Operaciones vectorizadas sobre cadenas de texto</a></span></li><li><span><a href="#Operaciones-con-series-temporales" data-toc-modified-id="Operaciones-con-series-temporales-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Operaciones con series temporales</a></span><ul class="toc-item"><li><span><a href="#Secuencias-regulares" data-toc-modified-id="Secuencias-regulares-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Secuencias regulares</a></span></li><li><span><a href="#Remuestreo" data-toc-modified-id="Remuestreo-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>Remuestreo</a></span></li><li><span><a href="#Desplazamiento-temporal" data-toc-modified-id="Desplazamiento-temporal-8.3"><span class="toc-item-num">8.3&nbsp;&nbsp;</span>Desplazamiento temporal</a></span></li><li><span><a href="#Estadísticas-contínuas" data-toc-modified-id="Estadísticas-contínuas-8.4"><span class="toc-item-num">8.4&nbsp;&nbsp;</span>Estadísticas contínuas</a></span></li></ul></li><li><span><a href="#Alto-rendimiento" data-toc-modified-id="Alto-rendimiento-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Alto rendimiento</a></span><ul class="toc-item"><li><span><a href="#pd.eval()" data-toc-modified-id="pd.eval()-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>pd.eval()</a></span></li><li><span><a href="#df.eval()" data-toc-modified-id="df.eval()-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>df.eval()</a></span></li><li><span><a href="#df.query()" data-toc-modified-id="df.query()-9.3"><span class="toc-item-num">9.3&nbsp;&nbsp;</span>df.query()</a></span></li></ul></li></ul></div>

> **Disclaimer**: Este notebook contiene mis notas sobre Pandas, resumiendo básicamente el [capítulo 3](https://jakevdp.github.io/PythonDataScienceHandbook/03.00-introduction-to-pandas.html) de [Python Data Science Handbook](https://jakevdp.github.io/PythonDataScienceHandbook/index.html) escrito por [Jake VanderPlas](http://vanderplas.com/). Recomiendo leer la fuente original e ir ejecutando todos los ejemplos (___learn by doing!___).

## Intro

[Pandas](https://pandas.pydata.org/) (Numerical Python) es una librería construida sobre NumPy para manipular estructuras de datos heterogéneos y etiquetados (dataframes). Pandas ofrece herramientas para tratar estas estructuras de forma eficiente, pudiendo realizar análisis de datos extensivos.

Los arrays de NumPy son perfectos para trabajar con datos limpios y organizados usando operaciones numéricas, pero sus limitaciones son claras cuando necesitamos flexibilidad (etiquetar datos, trabajar con datos faltantes, operaciones que no encajen con broadcasting, datos heterogéneos, etc). Pandas introduce los objetos **Series** y **DataFrame** para poder llevar a cabo las tareas de acomodar y pulir los datos en crudo con el fin de preparar los datos para su análisis.

Para poder usar Pandas, simplemente tendremos que importar la librería :)

In [1]:
# Pandas suele importarse con el alias pd
import pandas as pd

In [2]:
# Resto de imports
import numpy as np

## Objetos de Pandas

### `Series`

Se trata de un array unidimensional de datos indexados. Los índices son explícitos, lo que diferencia un objeto Series de Pandas de un array de NumPy, y además nos permite usar índices de cualquier otro tipo que no sea entero.

Podemos ver el objeto Series también como un caso particular de un diccionario de Python, pero ordenado (permitiendo slicing) y con mejor eficiencia para casos determinados, debido a que todos los índices son del mismo tipo.

Podemos crearlo a partir de una lista, un array de NumPy o un diccionario (en este último caso los índices por defecto serán las claves del diccionario ordenadas). Podemos incluso crearlo a partir de un escalar, que se repetirá tantas veces como longitud tenga el índice.

In [3]:
# Ejemplo a partir de un array sin especificar los índices (por defecto será una secuencia de enteros)
pd.Series([0, 0.25, 0.5, 0.75, 1.0])

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [4]:
# Mismo ejemplo especificando los índices
serie = pd.Series([0, 0.25, 0.5, 0.75, 1.0],
                index=[0, 'a', 'b', 'c', 'e'])
serie

0    0.00
a    0.25
b    0.50
c    0.75
e    1.00
dtype: float64

In [5]:
# Ejemplo a partir de un diccionario, usando index para quedarnos sólo una parte
pd.Series({1:'a', 2:'b', 3:'c'}, index=[3, 2])

3    c
2    b
dtype: object

Para obtener los valores del objeto Series usamos el atributo **values**. Devuelve un array de NumPy.

In [6]:
serie.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

Para obtener los índices usamos el atributo **index**. Devuelve una especie de array de tipo pd.Index.

In [7]:
serie.index

Index([0, 'a', 'b', 'c', 'e'], dtype='object')

### `DataFrame`

Se trata de un array bidimensional de datos doblemente indexados; esto es, una matriz de filas y columnas etiquetadas. Podemos verlo también como una versión ordenada de un diccionario de objetos Series.

Creamos un ejemplo de DataFrame usando 2 diccionarios de partida:

In [8]:
provinces_population = {'Madrid': 6578079, 'Barcelona': 5609350, 'Valencia': 2547986, 
                        'Sevilla': 1939887, 'Alicante': 1838819}
provinces_community = {'Madrid': 'Comunidad de Madrid', 'Valencia': 'Comunidad Valenciana', 
                        'Sevilla': 'Andalucía', 'Alicante': 'Comunidad Valenciana', 'Bilbao': 'Euskadi'}

# Creamos un diccionario con 2 claves, una para cada diccionario:
provinces = pd.DataFrame({'population': provinces_population, 'community': provinces_community})
provinces

           population             community
Alicante    1838819.0  Comunidad Valenciana
Barcelona   5609350.0                   NaN
Bilbao            NaN               Euskadi
Madrid      6578079.0   Comunidad de Madrid
Sevilla     1939887.0             Andalucía
Valencia    2547986.0  Comunidad Valenciana

Como podemos observar, cuando no coinciden los índices de los diccionarios se rellenarán los huecos con NaN ("Not a Number").

En el atributo **index** tendremos los índices de las filas:

In [9]:
provinces.index

Index(['Alicante', 'Barcelona', 'Bilbao', 'Madrid', 'Sevilla', 'Valencia'], dtype='object')

En el atributo **columns** tendremos los índices de las columnas:

In [10]:
provinces.columns

Index(['population', 'community'], dtype='object')

En el atributo **values** estarán todos los valores:

In [11]:
provinces.values

array([[1838819.0, 'Comunidad Valenciana'],
       [5609350.0, nan],
       [nan, 'Euskadi'],
       [6578079.0, 'Comunidad de Madrid'],
       [1939887.0, 'Andalucía'],
       [2547986.0, 'Comunidad Valenciana']], dtype=object)

Podemos crear un DataFrame de muchas maneras. En el ejemplo hemos visto cómo crearlo a partir de un diccionario de diccionarios (que también podría haber sido un diccionario de objetos Series). A continuación más ejemplos:

In [12]:
# DataFrame creado a partir de un único objeto Series:
pd.DataFrame(serie, columns=['valor'])

   valor
0   0.00
a   0.25
b   0.50
c   0.75
e   1.00

In [13]:
# DataFrame creado a partir de una lista de diccionarios (cada elemento será una fila)
pd.DataFrame([{'a': i, 'b': i**2} for i in range(1, 4)])

   a  b
0  1  1
1  2  4
2  3  9

In [14]:
# DataFrame creado a partir de un array bidimensional de NumPy
pd.DataFrame(np.random.rand(2,3), columns=['a', 'b', 'c'], index=[1, 2])

          a         b         c
1  0.095577  0.172149  0.589773
2  0.981727  0.034017  0.499773

También podemos crear un DataFrame directamente a partir de un array estructurado de NumPy:

In [15]:
pd.DataFrame(np.ones(3, dtype=[('A', 'i8'), ('B', 'f8')]))

   A    B
0  1  1.0
1  1  1.0
2  1  1.0

Otra opción es crear el DataFrame a partir de un fichero en formato JSON, usando el método `pd.read_json('file')`

Finalmente, podemos transponer el DataFrame como si fuera una matriz

In [16]:
provinces.T

,Alicante,Barcelona,Bilbao,Madrid,Sevilla,Valencia
population,1.83882e+06,5.60935e+06,NaN,6.57808e+06,1.93989e+06,2.54799e+06
community,Comunidad Valenciana,NaN,Euskadi,Comunidad de Madrid,Andalucía,Comunidad Valenciana

### `Index`

Ya hemos podido usar esta estructura en los ejemplos de Series y DataFrame. Podemos verlo como un array **inmutable**. Que los índices no sean modificables es una medida de seguridad por si varios objetos comparten el mismo Index.

Podemos construir un objeto Index:

In [17]:
# Ejemplo
ind = pd.Index([3, 6, 9, 12, 15])
ind

Int64Index([3, 6, 9, 12, 15], dtype='int64')

Como en los arrays, podemos acceder a un elemento o hacer slicing con corchetes. Además tendremos acceso a atributos disponibles en NumPy:

In [18]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

El objeto Index puede verse también como un conjunto ordenado. ¿Por qué? porque podemos calcular la intersección (`&`), la unión (`|`), o la diferencia simétrica (`^`) de dos objetos Index.

### `Panel` y `Panel4D`

Pandas proporciona estos 2 objetos para manejar datos con 3 y 4 dimensiones respectivamente, de forma nativa. Aunque en la práctica lo más común es hacer uso del indexado jerárquico o multi-indexado.

## Indexado y selección de datos

### Series

In [19]:
# Ejemplo
serie

0    0.00
a    0.25
b    0.50
c    0.75
e    1.00
dtype: float64

Como en Numpy podemos **indexar** sus elementos usando corchetes:

In [20]:
# Obtener el valor en un índice
serie['e']

1.0

El **slicing** tiene una particularidad; si lo hacemos con índices explícitos, el último índice está incluido en la selección. En cambio, si usamos índices implícitos, el último índice está excluido como siempre.

In [21]:
# Slicing por índices explícitos
serie['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [22]:
# Slicing por índices implícitos
serie[0:2]

0    0.00
a    0.25
dtype: float64

In [23]:
# Masking
serie[(serie > 0.4) & (serie < 0.6)]

b    0.5
dtype: float64

In [24]:
# Indexado múltiple (fancy)
serie[[0, 'e']]

0    0.0
e    1.0
dtype: float64

Si tenemos índices numéricos explícitos, las operaciones de indexado usarán estos índices, pero las operaciones de slicing usarán los índices implícitos.

In [25]:
serie2 = pd.Series(['a', 'b', 'c'], index=[2, 3, 4])

serie2[2]

'a'

In [26]:
serie2[1:3]

3    b
4    c
dtype: object

Para evitar este tipo de confusiones, Pandas proporciona unos atributos especiales para el objeto Series:
 * `loc` : referencia a los índices explícitos
 * `iloc` : referencia a los índices implícitos
 * `ix` : *deprecated*
 
Es recomendable escribirlos siempre, y usar índices explícitos en lugar de implícitos siempre que podamos.

In [27]:
# Ejemplo
serie2.iloc[2]

'c'

In [28]:
# Ejemplo
serie2.loc[1:3]

2    a
3    b
dtype: object

### DataFrame

In [29]:
# Ejemplo
provinces

           population             community
Alicante    1838819.0  Comunidad Valenciana
Barcelona   5609350.0                   NaN
Bilbao            NaN               Euskadi
Madrid      6578079.0   Comunidad de Madrid
Sevilla     1939887.0             Andalucía
Valencia    2547986.0  Comunidad Valenciana

Para **indexar** los datos podemos especificar un único índice (por defecto es un índice explícito), con lo que obtendremos una columna indexada. La columna no es más que un objeto de tipo Series. También podemos especificar un segundo índice, con lo que obtendríamos un único valor:

In [30]:
# Indexado. Usando corchetes o el típico acceso a un atributo (provinces.population).
# NOTA: Mejor corchetes! lo otro no funciona si la columna se llama igual que un método de DataFrame, como por ejemplo pop.
provinces['population']

Alicante     1838819.0
Barcelona    5609350.0
Bilbao             NaN
Madrid       6578079.0
Sevilla      1939887.0
Valencia     2547986.0
Name: population, dtype: float64

In [31]:
# Indicamos un índice / fila dentro de esa misma serie 
provinces['population']['Madrid']

6578079.0

In [32]:
# Podemos usar el indexado para crear una nueva columna:
provinces['population_M'] = round(provinces['population'] / 1000000, 2)
provinces

           population             community  population_M
Alicante    1838819.0  Comunidad Valenciana          1.84
Barcelona   5609350.0                   NaN          5.61
Bilbao            NaN               Euskadi           NaN
Madrid      6578079.0   Comunidad de Madrid          6.58
Sevilla     1939887.0             Andalucía          1.94
Valencia    2547986.0  Comunidad Valenciana          2.55

In [33]:
# Podemos seleccionar una fila concreta en lugar de una columna usando los índices implícitos
provinces.iloc[3]

population              6.57808e+06
community       Comunidad de Madrid
population_M                   6.58
Name: Madrid, dtype: object

In [34]:
# También podemos seleccionar sólo los valores de una fila con el atributo values
provinces.values[3]

array([6578079.0, 'Comunidad de Madrid', 6.58], dtype=object)

In [35]:
# Seleccionar un valor con índices explícitos como si de un array se tratase
provinces.loc['Madrid', 'population_M'] # Equivalente a provinces['population_M']['Madrid']

6.58

In [36]:
# Seleccionar un valor con índices implícitos
provinces.iloc[3, 2]

6.58

El **slicing**, al contrario que el indexado, se hace sobre filas

In [37]:
# Slicing con índices explícitos
provinces['Barcelona':'Madrid']

           population            community  population_M
Barcelona   5609350.0                  NaN          5.61
Bilbao            NaN              Euskadi           NaN
Madrid      6578079.0  Comunidad de Madrid          6.58

In [38]:
# Slicing con índices implícitos
provinces.iloc[:2, 1:]

                      community  population_M
Alicante   Comunidad Valenciana          1.84
Barcelona                   NaN          5.61

In [39]:
# Slicing con índices explícitos
provinces.loc[:'Barcelona', 'community':]

                      community  population_M
Alicante   Comunidad Valenciana          1.84
Barcelona                   NaN          5.61

In [40]:
# Podemos combinar masking con indexado múltiple
provinces.loc[provinces.population_M > 4, ['community', 'population']]

                     community  population
Barcelona                  NaN   5609350.0
Madrid     Comunidad de Madrid   6578079.0

### Multi-indexado

Para utilizar más dimensiones de las establecidas para Series (1D) y DataFrame (2D) se utiliza el multi-indexado o indexado jerárquico, que consiste en incorporar distintos niveles para los índices dentro de un objeto `MultiIndex`. 

Imaginemos que tenemos el siguiente objeto Series pero queremos incorporar información temporal:

In [41]:
provinces['population_M']

Alicante     1.84
Barcelona    5.61
Bilbao        NaN
Madrid       6.58
Sevilla      1.94
Valencia     2.55
Name: population_M, dtype: float64

Podríamos vernos tentados de hacerlo usando un nuevo Index compuesto por tuplas (Ciudad, año) pero eso es precisamente lo que queremos evitar con MultiIndex.

Para crear un objeto multi-indexado lo más sencillo es pasar al constructor un multi-index. Y lo más recomendable es crear el multi-index primero. Para ello podemos usar varias formas:

In [42]:
# Ejemplo de creación de multi-index desde arrays
index=pd.MultiIndex.from_arrays([['Madrid', 'Madrid', 'Barcelona', 'Barcelona', 'Valencia', 'Valencia'], 
                                 [2017, 2018, 2017, 2018, 2017, 2018]])
index

MultiIndex(levels=[['Barcelona', 'Madrid', 'Valencia'], [2017, 2018]],
           codes=[[1, 1, 0, 0, 2, 2], [0, 1, 0, 1, 0, 1]])

In [43]:
# Ejemplo de creación de multi-index desde tuplas
index=pd.MultiIndex.from_tuples([('Madrid', 2017), ('Madrid', 2018), ('Barcelona', 2017), 
                                 ('Barcelona', 2018), ('Valencia', 2017), ('Valencia', 2018)])
index

MultiIndex(levels=[['Barcelona', 'Madrid', 'Valencia'], [2017, 2018]],
           codes=[[1, 1, 0, 0, 2, 2], [0, 1, 0, 1, 0, 1]])

In [44]:
# Ejemplo de creación de multi-index desde un producto de arrays con índices únicos. Asignamos nombres!
index=pd.MultiIndex.from_product([['Madrid', 'Barcelona', 'Valencia'], [2017, 2018]], 
                                 names=['ciudad', 'año'])
index

MultiIndex(levels=[['Barcelona', 'Madrid', 'Valencia'], [2017, 2018]],
           codes=[[1, 1, 0, 0, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['ciudad', 'año'])

In [45]:
# Ejemplo de creación de objeto Series con multi-index
serie = pd.Series([6.4, 6.5, 5.5, 5.6, 2.5, 2.5], index=index)
serie

ciudad     año
Madrid     2017    6.4
           2018    6.5
Barcelona  2017    5.5
           2018    5.6
Valencia   2017    2.5
           2018    2.5
dtype: float64

In [46]:
# Accedemos a la información para Madrid usando un índice normal
serie['Madrid']

año
2017    6.4
2018    6.5
dtype: float64

In [47]:
# Accedemos a la información para el año 2017 usando un índice compuesto
serie[:, 2017]

ciudad
Madrid       6.4
Barcelona    5.5
Valencia     2.5
dtype: float64

Podemos pasar fácilmente de un objeto Series a un DataFrame usando el método `unstack()`. La operación inversa se lograría con `stack()`

In [48]:
df = serie.unstack()
df

año        2017  2018
ciudad
Barcelona   5.5   5.6
Madrid      6.4   6.5
Valencia    2.5   2.5

También podemos crear una columna nueva a partir de un índice de fila:

In [49]:
serie_flat = serie.reset_index(name='population')
serie_flat

      ciudad   año  population
0     Madrid  2017         6.4
1     Madrid  2018         6.5
2  Barcelona  2017         5.5
3  Barcelona  2018         5.6
4   Valencia  2017         2.5
5   Valencia  2018         2.5

El paso contrario es bastante utilizado cuando partimos de datos en crudo:

In [50]:
serie_flat.set_index(['ciudad', 'año'])

                population
ciudad    año
Madrid    2017         6.4
          2018         6.5
Barcelona 2017         5.5
          2018         5.6
Valencia  2017         2.5
          2018         2.5

La gracia del multi-indexado no es pasar de 1 a 2 dimensiones, sino por ejemplo de 2 a 3:

In [51]:
# Ejemplo
df_3 = pd.DataFrame({'total': serie, 'over65': [1.4, 1.5, 1.1, 1.1, 0.5, 0.5]})
df_3

                total  over65
ciudad    año
Madrid    2017    6.4     1.4
          2018    6.5     1.5
Barcelona 2017    5.5     1.1
          2018    5.6     1.1
Valencia  2017    2.5     0.5
          2018    2.5     0.5

En un DataFrame tanto las filas como las columnas pueden tener multi-index. Vemos un ejemplo para 4 dimensiones:

In [52]:
index = pd.MultiIndex.from_product([[2017, 2018], ['Q1', 'Q2', 'Q3', 'Q4']],
                                   names=['año', 'cuatrimestre'])
columns = pd.MultiIndex.from_product([['Madrid', 'Barcelona'], ['t_med', 't_max']],
                                     names=['ciudad', 'medida'])
data = [[10, 24, 12, 22], [15, 34, 16, 29], [16, 39, 15, 35], [11, 28, 13, 27],
       [11, 26, 11, 20], [16, 38, 17, 31], [15, 39, 14, 34], [12, 31, 14, 28]]

temp_data = pd.DataFrame(data, index=index, columns=columns)
temp_data

ciudad            Madrid       Barcelona
medida             t_med t_max     t_med t_max
año  cuatrimestre
2017 Q1               10    24        12    22
     Q2               15    34        16    29
     Q3               16    39        15    35
     Q4               11    28        13    27
2018 Q1               11    26        11    20
     Q2               16    38        17    31
     Q3               15    39        14    34
     Q4               12    31        14    28

In [53]:
# Indexar una columna (indexado parcial)
temp_data['Madrid']

medida             t_med  t_max
año  cuatrimestre
2017 Q1               10     24
     Q2               15     34
     Q3               16     39
     Q4               11     28
2018 Q1               11     26
     Q2               16     38
     Q3               15     39
     Q4               12     31

In [54]:
# Indexar una subcolumna
temp_data['Madrid']['t_med']

año   cuatrimestre
2017  Q1              10
      Q2              15
      Q3              16
      Q4              11
2018  Q1              11
      Q2              16
      Q3              15
      Q4              12
Name: t_med, dtype: int64

In [55]:
# Indexamos hasta un único elemento
temp_data['Madrid']['t_med'][2018]['Q1']

11

In [56]:
# Lo mismo pero empezando el indexado por las filas
temp_data.loc[2018, 'Q1']['Madrid', 't_med']
temp_data.loc[(2018, 'Q1'), ('Madrid', 't_med')] # Equivalente

11

In [57]:
# Una selección más...
temp_data.loc[2018, :]['Madrid', 't_med']

cuatrimestre
Q1    11
Q2    16
Q3    15
Q4    12
Name: (Madrid, t_med), dtype: int64

In [58]:
# Slicing! No funcionará si el índice en cuestión no está ordenado
temp_data['Madrid']['t_med'][2018]['Q1':'Q2']

cuatrimestre
Q1    11
Q2    16
Name: t_med, dtype: int64

In [59]:
# Masking
temp_data[temp_data > 15]

ciudad            Madrid       Barcelona
medida             t_med t_max     t_med t_max
año  cuatrimestre
2017 Q1              NaN    24       NaN    22
     Q2              NaN    34      16.0    29
     Q3             16.0    39       NaN    35
     Q4              NaN    28       NaN    27
2018 Q1              NaN    26       NaN    20
     Q2             16.0    38      17.0    31
     Q3              NaN    39       NaN    34
     Q4              NaN    31       NaN    28

In [60]:
# Fancy indexing, con doble corchete
serie[['Madrid', 'Valencia']]

ciudad    año
Madrid    2017    6.4
          2018    6.5
Valencia  2017    2.5
          2018    2.5
dtype: float64

Para que funcione el slicing los índices tendrán que están ordenados. Si no lo están, podemos usar la función `sortindex()` o `sortlevel()` sobre nuestro objeto.

Podemos hacer agregaciones para un índice concreto usando el parámetro level:

In [61]:
temp_data_max = temp_data.max(level='año')
temp_data_max

ciudad Madrid       Barcelona
medida  t_med t_max     t_med t_max
año
2017       16    39        16    35
2018       16    39        17    34

In [62]:
# También con columnas haciendo uso de index
temp_data_max = temp_data.max(level='medida', axis=1)
temp_data_max

medida             t_med  t_max
año  cuatrimestre
2017 Q1               12     24
     Q2               16     34
     Q3               16     39
     Q4               13     28
2018 Q1               11     26
     Q2               17     38
     Q3               15     39
     Q4               14     31

## Operaciones con datos

Pandas hereda las ufuncs de NumPy, incluyendo un par de cosas:
* ufuncs unarias: se conservan los índices de filas y columnas
* ufuncs binarias: se alinean automáticamente los índices de los dos objetos de entrada

En el caso de que los índices no casen, aparecen los valores NaN. Estos valores se pueden cambiar por otros si en lugar de usar por ejemplo el operador **A + B** usamos la función **A.add(B, fill_value=0)**

Relación entre operador y su método equivalente en Pandas:
 * `+` = add()
 * `-` = sub(), subtract()
 * `*` = mul(), multiply()
 * `/` = truediv)(, div(), divide()
 * `//` = floordiv()
 * `**` = pow()
 * `%` = mod()
 
Podemos hacer operaciones entre objetos Series y objetos DataFrame:

In [63]:
# Ejemplo
df = pd.DataFrame(np.random.rand(3, 4), columns=['a', 'b', 'c', 'd'], index=['zero', 'one', 'two'])
df

             a         b         c         d
zero  0.523668  0.632581  0.394963  0.432083
one   0.489190  0.183535  0.501738  0.722855
two   0.723278  0.506717  0.642517  0.307394

In [64]:
# Las operaciones por defecto con DataFrames se realizan por filas
df - df.loc['zero']

             a         b         c         d
zero  0.000000  0.000000  0.000000  0.000000
one  -0.034477 -0.449046  0.106775  0.290773
two   0.199611 -0.125864  0.247554 -0.124689

In [65]:
# Si queremos operar por columna, usamos los métodos de Pandas en lugar de los operadores, para poder especificar axis
df.sub(df['a'], axis=0)

        a         b         c         d
zero  0.0  0.108914 -0.128705 -0.091585
one   0.0 -0.305655  0.012548  0.233665
two   0.0 -0.216561 -0.080761 -0.415885

In [66]:
# Ejemplo restando a un DataFrame parte del mismo. Los índices se conservan, pero aparece NaN donde no coincidían
df - df.iloc[0, ::2]

             a   b         c   d
zero  0.000000 NaN  0.000000 NaN
one  -0.034477 NaN  0.106775 NaN
two   0.199611 NaN  0.247554 NaN

### Operaciones con valores no disponibles

NaN (Not a Number) es una de las dos representaciones usadas en Pandas (y en NumPy) para valores no disponibles o faltantes (NA); siendo la otra None (el objeto nulo de Python). La ventaja de usar NaN es que se trata de un valor especial de punto flotante, y no tendremos errores a la hora de hacer operaciones como con None. Eso sí, cualquier operación normal con un NaN tendrá como resultado NaN (NumPy define versiones especiales de las operaciones más comunes para ignorar estos valores).

En la siguiente tabla se detalla lo que ocurre cuando se detecta un valor NA en un tipo específico de Pandas (NOTA: los strings se almacenan como dtype object):

<table>
  <tr>
    <th>dtype</th>
    <th>conversión</th>
    <th>NA</th>
  </tr>
  <tr>
    <td>floating</td>
    <td>-</td>
    <td>np.nan</td>
  </tr>
  <tr>
    <td>object</td>
    <td>-</td>
    <td>None ó np.nan</td>
  </tr>
    <tr>
    <td>integer</td>
    <td>a float64</td>
    <td>np.nan</td>
  </tr>
  <tr>
    <td>boolean</td>
    <td>a object</td>
    <td>None ó np.nan</td>
  </tr>
</table>

In [67]:
# Ejemplo con serie de integers -> conversión a float64, None a NaN
pd.Series([0, None])

0    0.0
1    NaN
dtype: float64

In [68]:
# Ejemplo con serie de objects -> conversión a object, None se queda igual
pd.Series([True, None])

0    True
1    None
dtype: object

Pandas cuenta con varios métodos para detectar, filtrar o reemplazar esos valores faltantes:
 * `isnull()` : devuelve una máscara indicando los valores NA como True
 * `notnull()` : devuelve una máscara indicando los valores NA como False
 * `dropna()` : devuelve una versión filtrada de los datos sin los valores NA
 * `fillna()` : devuelve una versión de los datos con los NA reemplazados
 
En el caso de un DataFrame, `dropna()` no puede eliminar únicamente los elementos NA. Se comportará de manera distinta dependiendo de sus parámetros:
 * `dropna()` : elimina las filas con NA
 * `dropna(axis='columns')` : elimina las columnas con NA
 * `dropna(how='all')` : elimina las filas con todos sus elementos NA
 * `dropna(thresh=n)` : elimina las filas con menos de n valores distintos de NA
 
El método `fillna()` también cuenta con varias opciones:
 * `fillna(0)` : reemplaza los NA con el valor 0
 * `fillna(method='ffill')` : reemplaza los NA con el valor anterior (de la fila anterior si es un DataFrame)
 * `fillna(method='bfill')` : reemplaza los NA con el valor posterior (de la fila posterior si es un DataFrame)
 * `fillna(method='bfill', axis=1)` : reemplaza los NA con el valor de la columna posterior (DataFrame)

## Combinaciones de datasets
 
### Concatenación

La concatenación en Pandas es casi igual que NumPy, con la diferencia de que se conservan los índices incluso estando duplicados.

Pandas cuenta con varias funciones para combinar datos:
 * `pd.concat()` : concatenación flexible
  * axis : 0 (default) para concatenar añadiendo filas; 1 para añadir columnas
  * verify_integrity=True : devuelve error si encuentra índices duplicados
  * ignore_index=True : crea un nuevo Index para el resultado
  * keys : array de labels para crear multi-indexado y evitar conflictos de índices
  * join : outer (unión) o inner (intersección)
  * join_axes: especifica las columnas (o filas) a devolver especificando los índices
 * `append()` : método de Series y DataFrame para concatenar un segundo objeto

#### Concatenación simple

In [69]:
# Ejemplo
serie1 = pd.Series(['a', 'b', 'c'], index=[1, 2, 3])
serie2 = pd.Series(['d', 'e', 'f'], index=[1, 2, 4])
pd.concat([serie1, serie2])

1    a
2    b
3    c
1    d
2    e
4    f
dtype: object

In [70]:
# Lo mismo usando append
serie1.append(serie2)

1    a
2    b
3    c
1    d
2    e
4    f
dtype: object

In [71]:
# Con DataFrames
df1 = pd.DataFrame([{'a': i, 'b': i**2} for i in range(1, 4)])
df2 = -pd.DataFrame([{'c': i, 'd': i**2} for i in range(1, 4)])
pd.concat([df1, df2], axis=1)

   a  b  c  d
0  1  1 -1 -1
1  2  4 -2 -4
2  3  9 -3 -9

In [72]:
# Aplicando multi-indexado para evitar índices duplicados
pd.concat([serie1, serie2], keys=['s1', 's2'])

s1  1    a
    2    b
    3    c
s2  1    d
    2    e
    4    f
dtype: object

#### Concatenación mediante joins

Cuando los índices de los objetos en la dimensión que se concatenan no coinciden, por defecto Pandas rellena los valores no disponibles con NaN; es lo mismo que se logra escribiendo un join='outer', la unión. Si usamos join='inner', lo que se consigue es la intersección (se descartan las filas o columnas que no coinciden en ambos objetos)

In [73]:
pd.concat([serie1, serie2], axis=1, join='outer')

     0    1
1    a    d
2    b    e
3    c  NaN
4  NaN    f

In [74]:
pd.concat([serie1, serie2], axis=1, join='inner')

   0  1
1  a  d
2  b  e

Podemos usar también el parámetro join_axes, que recibe una lista de índices, para especificar las columnas (con axis=0; filas con axis=1) que deben ser devueltas

In [75]:
pd.concat([serie1, serie2], axis=1, join_axes=[serie1.index])

   0    1
1  a    d
2  b    e
3  c  NaN

### Merge y Join

Una de las características esenciales de Pandas son sus operaciones (de alto rendimiento en memoria) merge y join, similares a las que tenemos en BBDD :
 * `pd.merge()` : 1-1, N-1, N-M joins
  * `on` : especifica el nombre de la columna clave sobre la que se realiza el join
  * `left_on` | `right_on` (='columna') : especifica el nombre de la columna clave en ambos objetos (cuando es distinto). Introduce ambas columnas en el resultado final, pudiendo usar `drop('name', axis=n)` para eliminar una.
  * `left_index` | `right_index` (= True) : para hacer merge en un index en lugar de en una columna (on e index son compatibles!).
  * `how` : inner | outer | left | right (filas resultado: intersección | unión | izquierda | derecha)
  * `suffixes` (=['\_suff_1', '\_suff_2']) : si coinciden nombres de columna, se pueden especificar sufijos para su nombre en el resultado (por defecto \_x e \_y)
 * `join()` : método de Series y DataFrame para hacer merge con un segundo objeto, por defecto sobre los índices.
 
#### 1-1 join

Muy similar a una concatenación por columnas. La función merge detecta una columna común que usa como clave para realizar la unión, y por defecto lo hace sólo usando las filas que coincidan (equivalente a how='inner'):

In [76]:
# Ejemplo 1-1
df1 = pd.DataFrame([{'num': i, 'pow2': i**2} for i in range(1, 4)])
df2 = pd.DataFrame([{'num': i, 'pow3': i**3} for i in range(1, 5)])
pd.merge(df1, df2)

   num  pow2  pow3
0    1     1     1
1    2     4     8
2    3     9    27

#### N-1 join

Cuando una de las columnas comunes contiene valores duplicados:

In [77]:
# Ejemplo N-1
df3 = pd.DataFrame({'estudiante': ['Yago', 'Luisa', 'Carlos', 'Irene'],
                    'estudios': ['Periodismo', 'Teleco', 'Teleco', 'Informática']})
df4 = pd.DataFrame({'estudios': ['Periodismo', 'Informática', 'Teleco'],
                    'universidad': ['UCM', 'UPM', 'UPM']})
pd.merge(df3, df4)

  estudiante     estudios universidad
0       Yago   Periodismo         UCM
1      Luisa       Teleco         UPM
2     Carlos       Teleco         UPM
3      Irene  Informática         UPM

#### N-M join

Cuando las dos columnas comunes contienen valores duplicados:

In [78]:
# Ejemplo N-M
df5 = pd.DataFrame({'estudios': ['Periodismo', 'Informática', 'Teleco', 
                                 'Periodismo', 'Informática', 'Teleco'],
                    'habilidades': ['Síntesis', 'Programación', 'Programación', 
                                    'Redacción', 'Arquitectura', 'Transmisión']})
pd.merge(df3, df5)

  estudiante     estudios   habilidades
0       Yago   Periodismo      Síntesis
1       Yago   Periodismo     Redacción
2      Luisa       Teleco  Programación
3      Luisa       Teleco   Transmisión
4     Carlos       Teleco  Programación
5     Carlos       Teleco   Transmisión
6      Irene  Informática  Programación
7      Irene  Informática  Arquitectura

In [79]:
# Ejemplo de merge sobre índices
df1_i = df1.set_index('num')
df2_i = df2.set_index('num')
pd.merge(df1_i, df2_i, left_index=True, right_index=True)

     pow2  pow3
num
1       1     1
2       4     8
3       9    27

In [80]:
# Lo mismo usando join()
df1_i.join(df2_i)

     pow2  pow3
num
1       1     1
2       4     8
3       9    27

## Agregación y agrupamiento

### Agregación simple

Para un objeto Series, el resultado de una agregación es un único valor; para un DataFrame el resultado es un objeto Series; la agregación se aplica a cada columna (default) o fila (axis='columns').

Pandas hereda las agregaciones de NumPy. Estos son los métodos disponibles para Series y DataFrame:

 * Suma: `x.sum()`
 * Máximo: `x.max()`
 * Mínimo: `x.min()`
 * Producto: `x.prod()`
 * Media: `x.mean()`
 * Desviación estándar: `x.std()`
 * Desviación media: `x.mad()`
 * Varianza: `x.var()`
 * Mediana: `x.median()`
 * Primer elemento: `x.first()`
 * Último elemento: `x.last()`
 * Longitud: `x.count()`

Además, aporta la función `describe()`, que devuelve los agregados más comunes.

### Agregación sobre subconjuntos: GroupBy.

La operación `groupby()` permite hacer agregaciones más complejas sobre subconjuntos de los datos. Esta operación también se conoce como "split-apply-combine" (separar o agrupar los datos en subconjuntos, aplicar la operación de agregación a cada uno de ellos, y combinar los resultados en un array).

El resultado de ejecutar groupby() es un objeto `GroupBy` (DataFrameGroupBy o SeriesGroupBy). Sobre dicho objeto aplicaremos la operación de agregación adecuada.

In [81]:
# Ejemplo
df = pd.DataFrame({'key': ['a', 'b', 'c', 'a', 'b', 'c'], 'data': range(6), 'data10': range(0,60,10)})
df

  key  data  data10
0   a     0       0
1   b     1      10
2   c     2      20
3   a     3      30
4   b     4      40
5   c     5      50

In [82]:
df.groupby('key')

In [83]:
df.groupby('key').sum()

     data  data10
key
a       3      30
b       5      50
c       7      70

In [84]:
# Podemos crear una clave específica para hacer el groupby
k = [0, 1, 2, 2, 1, 0]
df.groupby(k).sum()

   data  data10
0     5      50
1     5      50
2     5      50

Podemos ver el objeto `GroupBy` como una colección de DataFrames. Podremos hacer varias cosas sobre este objeto:
 * Indexado sobre columna (y aplicación de la operación de agregación sobre ella)
 * Iteración sobre los grupos
 * Uso de describe() sobre los grupos

El objeto `GroupBy` proporciona las siguientes operaciones:
 * `aggregate()` : permite hacer agregaciones de forma más flexible
 * `filter()` : filtrado por condiciones aplicadas sobre los grupos
 * `transform()` : permite hacer transformaciones en lugar de agregaciones
 * `apply()` : permite aplicar una función cualquiera a los resultados grupales, devolviendo un DataFrame o un escalar.

In [85]:
# Ejemplo con aggregate() aplicando varias agregaciones
df.groupby('key')['data'].aggregate(['min', np.median, max]) # un string, una función de NumPy y otra de Pandas

     min  median  max
key
a      0     1.5    3
b      1     2.5    4
c      2     3.5    5

In [86]:
# Ejemplo con aggregate() diferenciando agregación por columna
df.groupby('key').aggregate({'data': 'min', 'data10': 'max'})

     data  data10
key
a       0      30
b       1      40
c       2      50

In [87]:
# Ejemplo con filter()
def filtro(x):
    return x['data'].mean() > 2

df.groupby('key').filter(filtro)

  key  data  data10
1   b     1      10
2   c     2      20
4   b     4      40
5   c     5      50

In [88]:
# Ejemplo con transform() 
df.groupby('key').transform(lambda x: x/100)

   data  data10
0  0.00     0.0
1  0.01     0.1
2  0.02     0.2
3  0.03     0.3
4  0.04     0.4
5  0.05     0.5

In [89]:
# Ejemplo con apply() 
df.groupby('key').sum().apply(lambda x: x**2)

     data  data10
key
a       9     900
b      25    2500
c      49    4900

## Tablas dinámicas

Una tabla dinámica se puede ver como una versión multidimensional de GroupBy. Podemos crearlas usando el método `pivot_table()` de los objetos DataFrame. Este método cuenta con las siguientes opciones:
 * `values` : columna sobre la que agregar
 * `index` : atributos o variables para filas
 * `columns` : atributos o variables para columnas
 * `affgunc` : función, lista de funciones o diccionario con agregaciones (por defecto: np.mean)
 * `fill_value` : escalar con el que sustituir los NA
 * `dropna` : booleano para descartar columnas con todo NaN (default: True)
 * `margins` : booleano para crear una nueva fila/columna ("All") con los totales (default:False)
 * `margins_name` : string para cambiar "All" por otra cosa en margins

In [90]:
# Ejemplo con los datos de Titanic
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [91]:
# Tabla dinámica para obtener la media de supervivientes por sexo y clase
titanic.pivot_table('survived', index='sex', columns='class')

# Lo mismo con groupby, bastante más complicado:
# titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

Podemos añadir más dimensiones:

In [92]:
# Creamos intervalos fijos con la edad usando pd.cut, y usando percentiles con pd.qcut para las tarifas
age = pd.cut(titanic['age'], [0, 18, 40, 100])
fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table('survived', ['sex', age], ['class', fare])

class                       First                             Second  \
fare             (-0.001, 14.454] (14.454, 512.329] (-0.001, 14.454]
sex    age
female (0, 18]                NaN          0.909091         1.000000
       (18, 40]               NaN          0.979167         0.900000
       (40, 100]              NaN          0.961538         0.800000
male   (0, 18]                NaN          0.800000         0.000000
       (18, 40]               0.0          0.523810         0.078947
       (40, 100]              NaN          0.280000         0.153846

class                                         Third
fare             (14.454, 512.329] (-0.001, 14.454] (14.454, 512.329]
sex    age
female (0, 18]            1.000000         0.714286          0.318182
       (18, 40]           0.925926         0.454545          0.529412
       (40, 100]          0.875000         0.333333          0.000000
male   (0, 18]            0.818182         0.260870          0.178571
       (18, 40]           0.040000         0.136054          0.208333
       (40, 100]          0.000000         0.068966          0.000000

In [93]:
# Ejemplo usando aggfunc. Prescindimos del parámetro values por usar un diccionario
titanic.pivot_table(index='sex', columns='class', aggfunc={'survived':sum, 'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

## Operaciones vectorizadas sobre cadenas de texto

Pandas proporciona una serie de operaciones muy útiles a la hora de limpiar los datos del mundo real (valores NA, etc). Los objetos Series y DataFrame tienen un atributo `str`, que cuenta con una larga lista de métodos para realizar estas operaciones.

Por un lado tenemos los métodos básicos que se corresponden con métodos nativos de Python:

`len()`, `lower()`, `translate()`, `islower()`, `ljust()`, `upper()`, `startswith()`, `isupper()`, `rjust()`, `find()`, `endswith()`, `isnumeric()`, `center()`, `rfind()`, `isalnum()`, `isdecimal()`, `zfill()`, `index()`, `isalpha()`, `split()`, `strip()`, `rindex()`, `isdigit()`, `rsplit()`, `rstrip()`, `capitalize()`, `isspace()`, `partition()`, `lstrip()`, `swapcase()`, `istitle()`, `rpartition()`

Por otro, los métodos que usan expresiones regulares:

 * `match()` : invoca `re.match()` sobre cada elemento, devolviendo un booleano
 * `extract()` : invoca `re.match()` sobre cada elemento, devolviendo los grupos matcheados como strings
 * `findall()` : invoca `re.findall()` sobre cada elemento
 * `replace()` : reemplaza las ocurrencias de un patrón con otro string
 * `contains()` : invoca `re.search()` sobre cada elemento, devolviendo un booleano
 * `count()` : cuenta las apariciones de un patrón
 * `split()` : equivalente a `str.split()` pero aceptando regexps 
 * `rsplit()` : equivalente a `str.rsplit()` pero aceptando regexps
 
Y por último métodos adicionales de utilidad:
 * `get()` : indexa cada elemento. Escribir df.str.get(0) es equivalente a df.str[0]
 * `slice()` : trocea cada elemento. Escribir df.str.slice(0, 2) es equivalente a df.str[0:2]
 * `slice_replace()` : reemplaza un trozo en cada elemento
 * `cat()` : concatenación de cadenas
 * `repeat()` : repetición de valores
 * `normalize()` : devuelve la representación unicode de un string
 * `pad()` : añade espacios en blanco al principio, al final o ambos
 * `wrap()` : trocea cadenas largas en varias líneas con una longitud menor a la indicada
 * `join()` : une cadenas en cada elemento con un separador especificado
 * `get_dummies()` : extrae variables dummy como columnas de un dataframe
 
Más información: [Pandas: Working with text data](http://pandas.pydata.org/pandas-docs/stable/user_guide/text.html)

In [94]:
# Ejemplos
ss = pd.Series(['Arthur Dent', 'Marvin', 'Zaphod Beeblebrox', 'Ford Prefect', 'Tricia McMillan'])

In [95]:
# Extracción del nombre
ss.str.extract('([A-Za-z]+)')

        0
0  Arthur
1  Marvin
2  Zaphod
3    Ford
4  Tricia

In [96]:
# Slicing
ss.str[0:3]

0    Art
1    Mar
2    Zap
3    For
4    Tri
dtype: object

In [97]:
# Extracción del apellido (o no!) usando chain
ss.str.split().str.get(-1)

0          Dent
1        Marvin
2    Beeblebrox
3       Prefect
4      McMillan
dtype: object

## Operaciones con series temporales

Pandas fue desarrollado en el contexto de modelado financiero, por lo que cuenta con un gran conjunto de herramientas para trabajar con fechas y datos temporales.

Diferenciamos entre 3 tipos de estructuras.

 * **Marcas de tiempo** : Pandas proporciona un objeto `TimeStamp`, que aúna la facilidad de uso de los módulos *datetime* y *dateutil* de Python, con el eficiente almacenado y la interfaz vectorizada del tipo nativo (limitado) datetime64 de NumPy. Podremos construir un objeto `DatetimeIndex` a partir de un grupo de objetos TimeStamp, para usar como Index de Series o DataFrame. Podremos hacer indexado o selección como habitualmente.
 * **Incrementos de tiempo o duración** : Pandas proporciona el objeto `Timedelta`, que reemplaza a datetime.timedelta. La estructura Index asociada es `TimedeltaIndex`.
 * **Periodos de tiempo** : Pandas proporciona un objeto `Period`. La estructura Index asociada es `PeriodIndex`.

Métodos disponibles:
 * `to_datetime(s)` : parsea una fecha en formato texto (entiende distintas notaciones) y la convierte en TimeStamp, o parsea una lista de fechas y la convierte en DatetimeIndex.
 * `to_timedelta(s, freq)` : crea un objeto TimedeltaIndex a partir de una secuencia y una **frecuencia** (p. ej. 'D'; diaria).
 * `to_period(freq)` : transforma un objeto DatetimeIndex en un PeriodIndex

Frecuencias:
<table>
  <tr>
    <th>freq</th>
    <th>means... </th>
    <th>freq</th>
    <th>means... </th>
    <th>freq</th>
    <th>means... </th>
    <th>freq</th>
    <th>means... </th>
  </tr>
  <tr>
    <td>D</td>
    <td>day</td>
    <td>B</td>
    <td>business day</td>
  </tr>
  <tr>
    <td>W</td>
    <td>weekly</td>
  </tr>
  <tr>
    <td>M</td>
    <td>month end</td>
    <td>BM</td>
    <td>business month end</td>
    <td>MS</td>
    <td>month start</td>
    <td>BMS</td>
    <td>business month start</td>
  </tr>
  <tr>
    <td>Q</td>
    <td>quarter end</td>
    <td>BQ</td>
    <td>business quarter end</td>
    <td>QS</td>
    <td>quarter start</td>
    <td>BQS</td>
    <td>business quarter start</td>
  </tr>
  <tr>
    <td>A</td>
    <td>year end</td>
    <td>BA</td>
    <td>business year end</td>
    <td>AS</td>
    <td>year start</td>
    <td>BAS</td>
    <td>business year start</td>
  </tr>
  <tr>
    <td>H</td>
    <td>hours</td>
    <td>BH</td>
    <td>business hours</td>
  </tr>
  <tr>
    <td>T</td>
    <td>minutes</td>
  </tr>
  <tr>
    <td>S</td>
    <td>seconds</td>
  </tr>
  <tr>
    <td>L</td>
    <td>ms</td>
  </tr>
  <tr>
    <td>U</td>
    <td>us</td>
  </tr>
  <tr>
    <td>N</td>
    <td>ns</td>
  </tr>
</table>

In [98]:
# Ejemplo creación de TimeStamp a partir de una única fecha
date = pd.to_datetime("20th of February, 2019")
date

Timestamp('2019-02-20 00:00:00')

In [99]:
# Ejemplo creación de TimedeltaIndex, en días
delta = pd.to_timedelta(np.arange(15), 'D')
delta

TimedeltaIndex([ '0 days',  '1 days',  '2 days',  '3 days',  '4 days',
                 '5 days',  '6 days',  '7 days',  '8 days',  '9 days',
                '10 days', '11 days', '12 days', '13 days', '14 days'],
               dtype='timedelta64[ns]', freq=None)

In [100]:
# Conversión en serie temporal (TimeStamp + TimedeltaIndex = DatetimeIndex)
date + delta

DatetimeIndex(['2019-02-20', '2019-02-21', '2019-02-22', '2019-02-23',
               '2019-02-24', '2019-02-25', '2019-02-26', '2019-02-27',
               '2019-02-28', '2019-03-01', '2019-03-02', '2019-03-03',
               '2019-03-04', '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq=None)

In [101]:
# Ejemplo de creación de DatetimeIndex a partir de una lista de fechas
from datetime import datetime
dates = pd.to_datetime([datetime(2019, 7, 3), '4th of July, 2019',
                       '2019-Jul-6', '07-07-2019', '20190708'])
dates

DatetimeIndex(['2019-07-03', '2019-07-04', '2019-07-06', '2019-07-07',
               '2019-07-08'],
              dtype='datetime64[ns]', freq=None)

In [102]:
# Podemos crear un TimedeltaIndex por ejemplo restando una fecha a una lista
dates - date

TimedeltaIndex(['133 days', '134 days', '136 days', '137 days', '138 days'], dtype='timedelta64[ns]', freq=None)

### Secuencias regulares

Para facilitar la creación de secuencias de fechas, Pandas ofrece las siguientes funciones:
 * `pd.date_range()` : para timestamps
 * `pd.period_range()` : para periodos
 * `pd.timedelta_range()` : para deltas

In [103]:
# Ejemplo con timestamps
pd.date_range('2019-07-03', '2019-07-10') # = pd.date_range('2019-07-03', periods=8)

DatetimeIndex(['2019-07-03', '2019-07-04', '2019-07-05', '2019-07-06',
               '2019-07-07', '2019-07-08', '2019-07-09', '2019-07-10'],
              dtype='datetime64[ns]', freq='D')

In [104]:
# Con otra frecuencia
pd.date_range('2019-07-03', periods=8, freq='1H30T')

DatetimeIndex(['2019-07-03 00:00:00', '2019-07-03 01:30:00',
               '2019-07-03 03:00:00', '2019-07-03 04:30:00',
               '2019-07-03 06:00:00', '2019-07-03 07:30:00',
               '2019-07-03 09:00:00', '2019-07-03 10:30:00'],
              dtype='datetime64[ns]', freq='90T')

In [105]:
# Ejemplo con deltas
pd.timedelta_range(0, periods=8, freq='D')

TimedeltaIndex(['0 days', '1 days', '2 days', '3 days', '4 days', '5 days',
                '6 days', '7 days'],
               dtype='timedelta64[ns]', freq='D')

### Remuestreo

Con Pandas podemos remuestrear a una frecuencia más baja (submuestreo) o más alta (sobremuestreo):
 * `resample(freq)` : agrupa los datos con una determinada frecuencia (requiere aplicar una operación de agregación al resultado). 
 * `asfreq(freq [, method='func'])` : selecciona los datos con una determinada frecuencia (un punto cada x tiempo)
 
Al sobremuestrear generaremos por defecto valores NA. Con `asfreq()` podemos modificar esos valores gracias al parámetro method, que acepta como entrada 'bfill' o 'ffill' (igual que en el método fillna())

### Desplazamiento temporal

Podemos mover nuestros datos en el tiempo usando ciertos métodos:
 * `shift(n)` : desplaza los datos n veces la frecuencia original (hacia la derecha)
 * `tshift(n)` : desplaza el index n veces la frecuencia original (hacia la izquierda)
 
Esto puede ser útil para comparar los datos en distintos periodos.

### Estadísticas contínuas

Las estadísticas contínuas ("rolling statistics") son el tercer tipo de operaciones implementadas para las series temporales en Pandas. La idea es generar ventanas de una duración determinada a lo largo de una serie temporal (podemos imaginarnos una ventana deslizante que va desde el principio de los datos hasta el final). Podremos obtener los estadísticos básicos de la sucesión de ventanas.

Usaremos:
 * `rolling()` : método de los objetos Series y DataFrame, que devuelve una vista similar a la devuelta por la operación groupby. Esta vista, conocida como "rolling window", no es más que una ventana deslizante que nos da la posibilidad de ejecutar varias operaciones de agregación incluidas sobre dicha ventana.
 
Si por ejemplo tenemos una serie temporal de 10 años, y le aplicamos el método rolling(365, center=True), obtendremos una ventana deslizante centrada de 1 año. Eso significa que si aplicamos la operación mean() sobre la ventana, obtendremos una nueva serie temporal cuyo valor en cada punto es la media de todos los valores de la serie temporal original dentro la ventana de 1 año centrada en ese punto.

> **Más información** sobre series temporales en: [Pandas doc: Time series](http://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html)

## Alto rendimiento

Tanto NumPy como Pandas soportan operaciones vectorizadas rápidas, como por ejemplo la suma elemento a elemento con '+'. Pero las operaciones son menos eficientes cuando tenemos expresiones compuestas, ya que se evalúan por partes, malgastando memoria y CPU para cada paso intermedio. Si los arrays involucrados son muy grandes, esto puede ser un problema.

El paquete `Numexpr`, y más en concreto la función `evaluate()` nos permite evaluar estas expresiones compuestas elemento a elemento, sin arrays intermedios. 

En la versión 0.13 de Pandas se introdujeron 2 funciones nuevas de alto nivel que permitían acceder a operaciones con la velocidad de C. Estas funciones son `eval()` y `query()`, basadas en Numexpr y similares a evaluate().

La cuestión es ¿cuándo usarlas? pues basicamente cuando vayamos justos de memoria porque los DataFrames son muy grandes (podemos usar `df.values.nbytes` para comprobar su tamaño). Por rapidez estamos hablando de una mejora aproximada de ~2x para DataFrames grandes, pero puede llegar a ser incluso un empeoramiento.

### pd.eval()

La función eval() recibe como parámetro un string que contiene una expresión con operaciones. Soporta:
 * todas las operaciones aritméticas
 * las comparaciones (incluso encadenadas)
 * los operadores `&`, `|`, `and` y `or` con booleanos
 * indexado mediante obj.atrib y obj[index]

Para otras operaciones, recurriremos al paquete Numexpr.

Vemos un ejemplo para comprobar la diferencia de rendimiento que obtenemos con su uso:

In [106]:
# Ejemplo sin eval()
seed = np.random.RandomState(42)
df1, df2, df3, df4 = (pd.DataFrame(seed.rand(100000, 100))
                      for i in range(4))
%timeit df1 + df2 + df3 + df4

86.1 ms ± 4.7 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [107]:
# Usando eval()
%timeit pd.eval('df1 + df2 + df3 + df4')

33.9 ms ± 283 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

### df.eval()

Funciona de forma similar a pd.eval() sobre DataFrames. Los beneficios de usar este método son varios:

 1. Las columnas pueden ser referenciadas simplemente escribiendo su nombre:

`pd.eval("(df.A + df.B) / (df.C - 1)")` vs `df.eval('(A + B) / (C - 1)')`

 2. También podemos crear una nueva columna:

`df.eval('D = (A + B) / (C - 1)' inplace=True)`

 3. Podemos usar variables de Python usando el prefijo `@`

### df.query()

Hay expresiones que no podremos evaluar con df.eval(), como por ejemplo la selección mediante masking (la expresión depende de columnas del dataframe):

`pd.eval('df[(df.A < 0.5) & (df.B < 0.5)]')`

Para resolver este problema tenemos la función df.query():

`df.query('A < 0.5 and B < 0.5')`

> **Más información** sobre mejoras del rendimiento en: [Pandas docs: Enhancing performance](https://pandas.pydata.org/pandas-docs/stable/user_guide/enhancingperf.html)